ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/crc32.xml
<module id="CRC32" HW_revision=""><register id="CRC32DI" width="16" offset="0x0" internal="0" description="Data Input for CRC32 Signature Computation"><bitfield id="DI" description="Data input for CRC32 Computation" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC32DIRB" width="16" offset="0x4" internal="0" description="Data In Reverse for CRC32 Computation"><bitfield id="DIRB" description="CRC32 data in bit reversed" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC32INIRES_LO" width="16" offset="0x8" internal="0" description="CRC32 Initialization and Result, lower 16 bits"><bitfield id="CRC32INIRES_LO" description="CRC32 initialization and result, lower 16 bits" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC32INIRES_HI" width="16" offset="0xA" internal="0" description="CRC32 Initialization and Result, upper 16 bits"><bitfield id="CRC32INIRES_HI" description="CRC32 initialization and result, upper 16 bits" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC32RESR_LO" width="16" offset="0xC" internal="0" description="CRC32 Result Reverse, lower 16 bits"><bitfield id="CRC32RESR_LO" description="CRC32 reverse result, lower 16 bits" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC32RESR_HI" width="16" offset="0xE" internal="0" description="CRC32 Result Reverse, Upper 16 bits"><bitfield id="CRC32RESR_HI" description="CRC32 reverse result, upper 16 bits" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC16DI" width="16" offset="0x10" internal="0" description="Data Input for CRC16 computation"><bitfield id="CRC16DI" description="CRC16 data in" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC16DIRB" width="16" offset="0x14" internal="0" description="CRC16 Data In Reverse"><bitfield id="CRC16DIRB" description="CRC16 data in reverse byte" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC16INIRES" width="16" offset="0x18" internal="0" description="CRC16 Initialization and Result register"><bitfield id="CRC16INIRES" description="CRC16 initialization and result" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CRC16RESR" width="16" offset="0x1E" internal="0" description="CRC16 Result Reverse"><bitfield id="CRC16RESR" description="CRC16 reverse result" begin="15" end="0" width="16" rwaccess="R/W"/></register></module>